# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 0s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 2s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 2s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Still reading... [00m10s elapsed]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 13s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.loki will be updated in-place
  ~ resource "helm_release" "loki" {
      ~ id                         = "loki" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2.9.10" -> (known after apply)
          ~ chart          = "loki-distributed" -> (known after apply)
          ~ first_deployed = 1753800931 -> (known after apply)
          ~ last_deployed  = 1753957837 -> (known after apply)
          ~ name           = "loki" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                ***********************************************************************
                 Welcome to Grafana Loki
                 Chart version: 0.80.0
                 Loki version: 2.9.10
                ***********************************************************************
                
                Installed components:
                * gateway
                * ingester
                * distributor
                * querier
                * query-frontend
            EOT -> (known after apply)
          ~ revision       = 5 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - backend        = {
                      - replicas = 0
                    }
                  - compactor      = {
                      - replicas = 1
                    }
                  - deploymentMode = "Distributed"
                  - distributor    = {
                      - maxUnavailable = 2
                      - replicas       = 3
                    }
                  - gateway        = {
                      - basicAuth = {
                          - enabled        = true
                          - existingSecret = "loki-basic-auth"
                        }
                      - service   = {
                          - type = "LoadBalancer"
                        }
                    }
                  - indexGateway   = {
                      - maxUnavailable = 1
                      - replicas       = 2
                    }
                  - ingester       = {
                      - maxUnavailable       = 1
                      - replicas             = 3
                      - zoneAwareReplication = {
                          - enabled = false
                        }
                    }
                  - loki           = {
                      - pattern_ingester = {
                          - enabled = true
                        }
                      - podLabels        = {
                          - "azure.workload.identity/use" = "true"
                        }
                      - storage          = {
                          - azure       = {
                              - accountName       = "k6clusterlokisa"
                              - useFederatedToken = true
                            }
                          - bucketNames = {
                              - chunks = "k6cluster-loki-chunks"
                              - ruler  = "k6cluster-loki-ruler"
                            }
                          - type        = "azure"
                        }
                      - structuredConfig = {
                          - compactor      = {
                              - delete_request_store = "azure"
                              - retention_enabled    = true
                            }
                          - ingester       = {
                              - chunk_encoding = "snappy"
                            }
                          - limits_config  = {
                              - allow_structured_metadata = true
                              - retention_period          = "672h"
                              - volume_enabled            = true
                            }
                          - querier        = {
                              - max_concurrent = 4
                            }
                          - ruler          = {
                              - enable_api = true
                              - storage    = {
                                  - azure = {
                                      - account_name        = "k6clusterlokisa"
                                      - container_name      = "k6cluster-loki-ruler"
                                      - use_federated_token = true
                                    }
                                  - type  = "azure"
                                }
                            }
                          - schema_config  = {
                              - configs = [
                                  - {
                                      - from         = "2024-04-01"
                                      - index        = {
                                          - period = "24h"
                                          - prefix = "loki_index_"
                                        }
                                      - object_store = "azure"
                                      - schema       = "v13"
                                      - store        = "tsdb"
                                    },
                                ]
                            }
                          - storage_config = {
                              - azure        = {
                                  - account_name        = "k6clusterlokisa"
                                  - container_name      = "k6cluster-loki-chunks"
                                  - use_federated_token = true
                                }
                              - tsdb_shipper = {
                                  - active_index_directory = "/var/loki/index"
                                  - cache_location         = "/var/loki/cache"
                                  - cache_ttl              = "168h"
                                }
                            }
                        }
                    }
                  - lokiCanary     = {
                      - extraArgs = [
                          - "-pass=$(LOKI_PASS)",
                          - "-user=$(LOKI_USER)",
                        ]
                      - extraEnv  = [
                          - {
                              - name      = "LOKI_PASS"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "password"
                                      - name = "canary-basic-auth"
                                    }
                                }
                            },
                          - {
                              - name      = "LOKI_USER"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "username"
                                      - name = "canary-basic-auth"
                                    }
                                }
                            },
                        ]
                    }
                  - minio          = {
                      - enabled = false
                    }
                  - querier        = {
                      - maxUnavailable = 2
                      - replicas       = 3
                    }
                  - queryFrontend  = {
                      - maxUnavailable = 1
                      - replicas       = 2
                    }
                  - queryScheduler = {
                      - replicas = 2
                    }
                  - read           = {
                      - replicas = 0
                    }
                  - ruler          = {
                      - maxUnavailable = 1
                      - replicas       = 1
                    }
                  - serviceAccount = {
                      - annotations = {
                          - "azure.workload.identity/client-id" = "178f9a67-6c3c-46d1-956d-5f8107ebc11a"
                        }
                      - labels      = {
                          - "azure.workload.identity/use" = "true"
                        }
                      - name        = "loki"
                    }
                  - singleBinary   = {
                      - replicas = 0
                    }
                  - write          = {
                      - replicas = 0
                    }
                }
            ) -> (known after apply)
          ~ version        = "0.80.0" -> (known after apply)
        } -> (known after apply)
        name                       = "loki"
      ~ values                     = [
          ~ <<-EOT
                loki:
              -    podLabels:
              -     "azure.workload.identity/use": "true"
              -    schemaConfig:
              -      configs:
              -        - from: "2024-04-01"
              -          store: tsdb
              -          object_store: azure
              -          schema: v13
              -          index:
              -            prefix: loki_index_
              -            period: 24h
              -    storageConfig:
              -      tsdb_shipper:
              -       active_index_directory: /var/loki/index
              -       cache_location: /var/loki/cache
              -       cache_ttl: 168h
              -      azure:
              -       account_name: "k6clusterlokisa"
              -       container_name: "k6cluster-loki-chunks"
              -       use_federated_token: true
              -    ingester:
              -        chunk_encoding: snappy
              -    pattern_ingester:
              -        enabled: true
              -    limits_config:
              -      allow_structured_metadata: true
              -      volume_enabled: true
              -      retention_period: 672h # 28 days retention
              -    compactor:
              -      retention_enabled: true
              -      delete_request_store: azure
              -    ruler:
              -     enable_api: true
              -     storage:
              -       type: azure
              +   pattern_ingester:
              +     enabled: true
              +   storage:
              +     type: azure
              +     bucketNames:
              +       chunks: "k6cluster-loki-chunks"
              +       ruler: "k6cluster-loki-ruler"
              +     azure:
              +       accountName: "k6clusterlokisa"
              +       useFederatedToken: true
              +   structuredConfig:
              +     limits_config:
              +       allow_structured_metadata: true
              +       volume_enabled: true
              +       retention_period: 672h # 28 days retention
              +     ingester:
              +       chunk_encoding: snappy
              +     compactor:
              +       retention_enabled: true
              +       delete_request_store: azure
              +     ruler:
              +       enable_api: true
              +       storage:
              +         type: azure
              +         azure:
              +           account_name: "k6clusterlokisa"
              +           container_name: "k6cluster-loki-ruler"
              +           use_federated_token: true
              +     querier:
              +       max_concurrent: 4
              +     schema_config:
              +       configs:
              +         - from: "2024-04-01"
              +           store: tsdb
              +           object_store: azure
              +           schema: v13
              +           index:
              +             prefix: loki_index_
              +             period: 24h
              +     storage_config:
              +       tsdb_shipper:
              +         active_index_directory: /var/loki/index
              +         cache_location: /var/loki/cache
              +         cache_ttl: 168h
                      azure:
                        account_name: "k6clusterlokisa"
              -         container_name: "k6cluster-loki-ruler"
              +         container_name: "k6cluster-loki-chunks"
                        use_federated_token: true
                
              -    querier:
              -       max_concurrent: 4
              +   podLabels:
              +     "azure.workload.identity/use": "true"
                
              -    storage:
              -       type: azure
              -       bucketNames:
              -         chunks: "k6cluster-loki-chunks"
              -         ruler: "k6cluster-loki-ruler"
              -       azure:
              -         accountName: "k6clusterlokisa"
              -         useFederatedToken: true
              - 
                # Define the Azure workload identity
                serviceAccount:
                  name: loki
                  annotations:
                    "azure.workload.identity/client-id": "178f9a67-6c3c-46d1-956d-5f8107ebc11a"
                  labels:
                    "azure.workload.identity/use": "true"
                
                deploymentMode: Distributed
                
                ingester:
              -  replicas: 3
              -  maxUnavailable: 1
              -  zoneAwareReplication:
              -   enabled: false
              +   replicas: 3
              +   maxUnavailable: 1
              +   zoneAwareReplication:
              +     enabled: false
                
                querier:
              -  replicas: 3
              -  maxUnavailable: 2
              +   replicas: 3
              +   maxUnavailable: 2
                
                queryFrontend:
              -  replicas: 2
              -  maxUnavailable: 1
              +   replicas: 2
              +   maxUnavailable: 1
                
                queryScheduler:
              -  replicas: 2
              +   replicas: 2
                
                distributor:
              -  replicas: 3
              -  maxUnavailable: 2
              +   replicas: 3
              +   maxUnavailable: 2
                compactor:
              -  replicas: 1
              +   replicas: 1
                
                indexGateway:
              -  replicas: 2
              -  maxUnavailable: 1
              +   replicas: 2
              +   maxUnavailable: 1
                
                ruler:
              -  replicas: 1
              -  maxUnavailable: 1
              +   replicas: 1
              +   maxUnavailable: 1
                
              - 
                # This exposes the Loki gateway so it can be written to and queried externaly
                gateway:
              -  service:
              -    type: LoadBalancer
              -  basicAuth:
              -      enabled: true
              -      existingSecret: loki-basic-auth
              +   service:
              +     type: LoadBalancer
              +   basicAuth:
              +     enabled: true
              +     existingSecret: loki-basic-auth
                
                # Since we are using basic auth, we need to pass the username and password to the canary
                lokiCanary:
                  extraArgs:
                    - -pass=$(LOKI_PASS)
                    - -user=$(LOKI_USER)
                  extraEnv:
                    - name: LOKI_PASS
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: password
                    - name: LOKI_USER
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: username
                
                # Enable minio for storage
                minio:
              -  enabled: false
              +   enabled: false
                
                backend:
              -  replicas: 0
              +   replicas: 0
                read:
              -  replicas: 0
              +   replicas: 0
                write:
              -  replicas: 0
              +   replicas: 0
                
                singleBinary:
              -  replicas: 0
              +   replicas: 0
            EOT,
        ]
      ~ version                    = "0.80.0" -> "0.80.5"
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `push` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`